# Taps
tap "homebrew/cask-fonts"

# Shell
brew "powerlevel10k"
brew "zsh-syntax-highlighting"
brew "fzf"
brew "zoxide"

# Core CLI
brew "bat"
brew "buku"
brew "eza"
brew "fastfetch"
brew "fd"
brew "gdu"
brew "git-delta"
brew "imagemagick"
brew "lazygit"
brew "neovim"
brew "pandoc"
brew "ripgrep"
brew "stow"
brew "tree"
brew "wget"
brew "yazi"

# Mail
brew "isync"
brew "khard"
brew "msmtp"
brew "neomutt"
brew "notmuch"
brew "urlscan"
brew "vdirsyncer"
brew "w3m"

# Languages & runtimes
brew "go"
brew "lua"
brew "luarocks"
brew "node"
brew "pipx"
brew "python@3.13"
# Rust: managed via rustup (https://rustup.rs), not brew

# Finance
brew "hledger"

# Dev tools
brew "cloudflared"
brew "markdownlint-cli"
brew "nmap"
brew "sqlfluff"
brew "stress"
brew "stylua"
brew "television"

# Media
brew "ffmpeg"

# Misc
brew "pass"
brew "pdftk-java"
brew "sqlite"

# Casks
cask "font-ibm-plex-mono"
cask "ghostty"
cask "kitty"
cask "mactex"
cask "obsidian"
